app/views/posts/_post.html.erb

SELECT COUNT(*) FROM "hearts" WHERE "hearts"."post_id" = ?  [["post_id", 1]]
---
	<small class='pull-right'>
	<%= post.hearts.count %> hearts